[
    {
        "id": "01",
        "name": "JavaScript",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqYfbaJ3eCkft5cB1BjSSN8pwLqODTGLTqOXQyIUhvWQSVSPgyG6bI5iH4S3mCVPdIV7w&usqp=CAU",
        "details": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities.avaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java.JavaScript made its first appearance in Netscape 2.0 in 1995",
        "title": "JavaScript is the world's most popular programming language. JavaScript is the programming language of the Web."
    },
    {
        "id": "02",
        "name": "React.js",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQc2Y2gmQB5zuaBd1AfN_AyEgoTgxPF65i7GwlvrbnnP_RUlubieG19WFnonCtS4ZfAox4&usqp=CAU",
        "details": "ReactJS is JavaScript library used for building reusable UI components. According to React official documentation, following is the definitionReact is a library for building composable user interfaces. It encourages the creation of reusable UI components, which present data that changes over time. Lots of people use React as the V in MVC. React abstracts away the DOM from you, offering a simpler programming model and better performance.React can also render on the server using Node, and it can power native apps using React Native.",
        "title": "React is a free and open-source front-end JavaScript library for building user interfaces based on UI components."
    },
    {
        "id": "03",
        "name": "Node.js",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT9WrdC46xULvIRCrlZ0y-mqV3F4a_IJRmuWbEw7f4TmN3zwaNxt45Z8TDB9Eczj0uDPNo&usqp=CAU",
        "details": "Node.js is a server-side platform built on Google Chrome's JavaScript Engine (V8 Engine). Node.js was developed by Ryan Dahl in 2009 and its latest version is v0.10.36. The definition of Node.js as supplied by its official documentation. Node.js is a platform built on Chrome's JavaScript runtime for easily building fast and scalable network applications. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.Node.",
        "title": "Node.js is an open-source, cross-platform, back-end JavaScript runtime environment that runs on a JavaScript Engine and executes JavaScript code outside a web browser"
    },
    {
        "id": "04",
        "name": "java",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQbk6-cfNgAGDMOQpWDx_m0yWbDC0xXqY201Q&usqp=CAU",
        "details": "Java programming language was originally developed by Sun Microsystems which was initiated by James Gosling and released in 1995 as core component of Sun Microsystems' Java platform (Java 1.0 [J2SE]).The latest release of the Java Standard Edition is Java SE 8. With the advancement of Java and its widespread popularity, multiple configurations were built to suit various types of platforms. For example: J2EE for Enterprise Applications, J2ME for Mobile Applications.The new J2 versions were renamed as Java SE, Java EE, and Java ME respectively.",
        "title": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible."
    },
    {
        "id": "05",
        "name": "Python",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS9w1pP1KmKFUB3_sFLuLROakUAnlQ9zAufF_mZxxuik-5x5MKkYPQE5ofF8ma99Ztx3jw&usqp=CAU",
        "details": "Python is a high-level, interpreted, interactive and object-oriented scripting language. Python is designed to be highly readable. It uses English keywords frequently where as other languages use punctuation, and it has fewer syntactical constructions than other languages.Python is Interpreted − Python is processed at runtime by the interpreter. You do not need to compile your program before executing it. This is similar to PERL and PHP.Python is Interactive You can actually sit at a Python prompt and interact with the interpreter directly to write your programs.",
        "title": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation."
    },
    {
        "id": "06",
        "name": "PHP",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRQ-tBhdhLVkf7KdkG_980DBu0bndbvbYE5gA&usqp=CAU",
        "details": "PHP started out as a small open source project that evolved as more and more people found out how useful it was. Rasmus Lerdorf unleashed the first version of PHP way back in 1994PHP is a recursive acronym for PHP: Hypertext Preprocessor.PHP is a server side scripting language that is embedded in HTML. It is used to manage dynamic content, databases, session tracking, even build entire e-commerce sites.It is integrated with a number of popular databases, including MySQL, PostgreSQL, Oracle, Sybase, Informix, and Microsoft SQL Server",
        "title": "PHP is a server scripting language, and a powerful tool for making dynamic and interactive Web pages."
    }
]